test/request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getJobRequest>
         <gs:job>12</gs:job>
      </gs:getJobRequest>
   </soapenv:Body>
</soapenv:Envelope>
